#Задание 1
z = int(input())
x = int(input())
if z > x:
    print ("Наибольшее число", z)
elif z < x:
    print ("Наибольшее число", x)
else:
    print("Равны")
#Задание 6
c = int(input())
v = 7
if c / v:
    print ("Кратно семи")
else:
    print("не кратно семи")
#Задание 12
b = int(input())
if b > 0:
    print("Чсило является положительным", b)
else:
    print("Число является отрицательным")
        
    